In [7]:
import pandas as pd
import numpy as np

In [2]:
my_obj=pd.Series([11,22,33,44])
print(my_obj)
print(my_obj.values)
print(my_obj.index)

0    11
1    22
2    33
3    44
dtype: int64
[11 22 33 44]
RangeIndex(start=0, stop=4, step=1)

In [4]:
print(my_obj.describe()) 
print(my_obj.dtypes)

count     4.000000
mean     27.500000
std      14.200939
min      11.000000
25%      19.250000
50%      27.500000
75%      35.750000
max      44.000000
dtype: float64
int64

In [1]:
my_obj.to_excel("titanic.xlsx", sheet_name="passengers", index=False)
titanic = obj.read_excel("titanic.xlsx", sheet_name="passengers")
print(titanic)

NameError: name 'obj' is not defined

In [11]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 1 columns):
0    4 non-null int64
dtypes: int64(1)
memory usage: 112.0 bytes

In [10]:
myobj=pd.Series([1,2,3,4,5,6],index=["j","f","m","a","j","jul"])
print(myobj)

j      1
f      2
m      3
a      4
j      5
jul    6
dtype: int64

In [14]:
myobl=pd.Series([10,22,30], index=["a","b","c"], name="my panad pbject")
print(myobl)

a    10
b    22
c    30
Name: my panad pbject, dtype: int64

In [16]:
print(myobl[1])
print(myobl["c"])

22
30

In [19]:
print(myobl[['b','c']])

b    22
c    30
Name: my panad pbject, dtype: int64

In [20]:
print(myobl[myobl>=22])

b    22
c    30
Name: my panad pbject, dtype: int64

In [22]:
myobj=myobj*2
print(myobj)

j       4
f       8
m      12
a      16
j      20
jul    24
dtype: int64

In [25]:
only for index
"j" in myobj

False

In [30]:
import numpy as np
ss=np.array([1,2,3,4,5,6])
ind=np.array(["a","b","c","d","e","f"])
sss=pd.Series(ss,index=ind)
print(sss)
ss4=pd.Series(ss)
print(ss4)

a    1
b    2
c    3
d    4
e    5
f    6
dtype: int32
0    1
1    2
2    3
3    4
4    5
5    6
dtype: int32

In [33]:
dic={"ali":100,"usaman":12,"usama":[10,20]}
pan=pd.Series(dic)
print(pan)
print(pan.values)

ali            100
usama     [10, 20]
usaman          12
dtype: object
[100 list([10, 20]) 12]

In [34]:
dic={"ali":100,"usaman":12,"usama":[10,20]}
pan=pd.Series(dic , index=['usama', 'ali','usman'])
print(pan)
print(pan.values)

usama    [10, 20]
ali           100
usman         NaN
dtype: object
[list([10, 20]) 100 nan]

In [4]:
dic={"ali":100,"usaman":12,"usama":[10,20]}
pan=pd.Series(dic , index=['usama', 'ali','usman','abc'])
print(pan)
print(pan.values)

usama    [10, 20]
ali           100
usman         NaN
abc           NaN
dtype: object
[list([10, 20]) 100 nan nan]

In [5]:
pan.isnull()

usama    False
ali      False
usman     True
abc       True
dtype: bool

In [9]:
apple=np.array([10,20,30,40,50])
orange=np.array([60,70,80,90,100])
data={"apple":apple , "orange":orange}
pd_data=pd.DataFrame(data,index=['a','b','c','d','e'])
print(pd_data)

   apple  orange
a     10      60
b     20      70
c     30      80
d     40      90
e     50     100

In [10]:
pd_data.head()

   apple  orange
a     10      60
b     20      70
c     30      80
d     40      90
e     50     100

In [49]:
pd_data['orange']

a     60
b     70
c     80
d     90
e    100
Name: orange, dtype: int32

In [11]:
pd_data=pd.DataFrame(data,columns=['orange','apple'])
pd_data

   orange  apple
0      60     10
1      70     20
2      80     30
3      90     40
4     100     50

In [12]:
pd_data=pd.DataFrame(data,columns=['orange','apple','banana'])
pd_data
pd_data.isnull()

   orange  apple  banana
0   False  False    True
1   False  False    True
2   False  False    True
3   False  False    True
4   False  False    True

In [13]:
pd_data.columns
pd_data.index

RangeIndex(start=0, stop=5, step=1)

In [14]:
print(pd_data.apple)
pd_data['orange']

0    10
1    20
2    30
3    40
4    50
Name: apple, dtype: int32

0     60
1     70
2     80
3     90
4    100
Name: orange, dtype: int32

In [63]:
pd_data

   orange  apple banana
0      60     10    NaN
1      70     20    NaN
2      80     30    NaN
3      90     40    NaN
4     100     50    NaN

In [66]:
pd_data.loc[1]

orange     70
apple      20
banana    NaN
Name: 1, dtype: object

In [15]:
rng=['o','h','j','o','l']

In [16]:
pd_data['banana']=rng

In [17]:
pd_data

   orange  apple banana
0      60     10      o
1      70     20      h
2      80     30      j
3      90     40      o
4     100     50      l

In [70]:
print(len(pd_data))

5

In [22]:
s=pd.Series=([50,50,50,50,50])
pd_data['banana']=s

In [23]:
pd_data

   orange  apple  banana
0      60     10      50
1      70     20      50
2      80     30      50
3      90     40      50
4     100     50      50

In [24]:
pd_data

   orange  apple  banana
0      60     10      50
1      70     20      50
2      80     30      50
3      90     40      50
4     100     50      50